[
  {
    "name": "Dasar-Dasar Pengembangan Website: HTML, CSS dan Javascript",
    "detail": "Kursus HTML, CSS, dan JavaScript adalah program pembelajaran yang dirancang untuk membantu seseorang mempelajari dasar-dasar pembuatan situs web. Materi yang akan diajarkan meliputi:\r\n\r\n1. HTML (Hypertext Markup Language) - Belajar tentang struktur dan elemen HTML untuk membuat halaman web.\r\n2. CSS (Cascading Style Sheets) - Belajar tentang gaya dan presentasi dari halaman web\r\n3.JavaScript - Belajar tentang bahasa pemrograman yang digunakan untuk membuat interaksi dan efek dinamis pada halaman web\r\n\r\n Kursus ini akan mencakup topik-topik seperti tag HTML, CSS selectors dan properti, box model, layering dan positioning, serta scripting dan manipulasi DOM menggunakan JavaScript. Siswa juga akan mempelajari tentang bagaimana menggabungkan HTML, CSS, dan JavaScript untuk membuat situs web yang dinamis dan interaktif.\r\n\r\nMetode pengajaran yang digunakan adalah diskusi teori dan praktik langsung bersama instruktur, serta latihan dan proyek individu atau kelompok. Tujuan dari kursus ini adalah untuk membantu siswa memahami dasar-dasar pembuatan situs web dan memiliki dasar yang kuat untuk memulai membuat situs web sendiri.",
    "level": "Beginner",
    "price": 125000,
    "imgUrl": "https://img-b.udemycdn.com/course/240x135/764164_de03_5.jpg",
    "type": "Offline",
    "CategoryId": 5,
    "InstructorId": 5
  },
  {
    "name": "Membangun Website Dari Basic dengan Mudah",
    "detail": "Pada Kursus ini berisi tentang membangun webiste dengan mudah bersama Udacoding.\r\n Materi yang akan di pelajari pada kursus ini: \r\n1.HTML dari basic \r\n2.CSS dari basic hingga advance \r\n3. Bootstrap dari basic",
    "level": "Beginner",
    "price": 105000,
    "imgUrl": "https://img-b.udemycdn.com/course/240x135/3066364_e36b_2.jpg",
    "type": "Online",
    "CategoryId": 5,
    "InstructorId": 5
  }, 
  {
    "name": "Complete Responsive Web Development: 4 courses in 1",
    "detail": "Web Responsive adalah sebuah desain situs web yang dapat menyesuaikan tampilannya untuk berbagai ukuran layar, seperti desktop, tablet, dan ponsel. Ini berarti bahwa halaman web akan menyesuaikan ukurannya dan posisinya untuk memastikan bahwa konten terlihat jelas dan mudah dibaca, tanpa membutuhkan scrolling horizontal atau zoom. Hal ini sangat penting saat ini karena lebih banyak orang mengakses situs web melalui perangkat seluler. Dengan desain yang responsif, situs web dapat memberikan pengalaman yang baik bagi pengunjung, tanpa memperhatikan perangkat yang mereka gunakan. Web Responsive membutuhkan penggunaan CSS media queries dan pembaruan layout melalui JavaScript. Desain Responsive juga membutuhkan penggunaan grid dan layout fleksibel yang memungkinkan elemen halaman untuk beradaptasi dengan ukuran layar yang berbeda.",
    "level": "Advanced",
    "price": 250000,
    "imgUrl": "https://img-b.udemycdn.com/course/240x135/1426718_abb7_2.jpg 1x, https://img-b.udemycdn.com/course/480x270/1426718_abb7_2.jpg 2x",
    "type": "Online",
    "CategoryId": 5,
    "InstructorId": 5
  }
]
